# Chapter 01
# Chapter 02

# Chapter 03 - Data Wrangling

In [2]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Show first 5 rows
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## Creating a DataFrame

In [3]:
# Load library
import pandas as pd

# Create dataframe
dataframe = pd.DataFrame()

# Add columns
dataframe['Name'] = ['Jack Jackson', 'Steven Stevenson']
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]

# Show dataframe
dataframe

               Name  Age  Driver
0      Jack Jackson   38    True
1  Steven Stevenson   25   False

In [4]:
# Create row
new_person = pd.Series(['Molly Moonet', 40, True], index=['Name', 'Age', 'Driver'])

# Append now
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0      Jack Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Moonet   40    True

## Describing the Data

In [6]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Show first 5 rows
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [7]:
dataframe.shape

(1313, 6)

In [8]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## Navigating DataFrames

In [9]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Show first row
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [10]:
# Show three rows
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [11]:
# Show first four rows
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [12]:
# Show first four rows
dataframe = dataframe.set_index(dataframe['Name'])

dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

## Selecting Rows Based on Conditionals

In [13]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Show top two rows where column 'sex' is 'female'
dataframe[dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [14]:
# Show top two rows where column 'sex' is 'female'
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65) ]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

## Replacing Values

In [24]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Replace values, show two rows
dataframe['Sex'].replace("female", "Woman").head(2)

0    Woman
1    Woman
Name: Sex, dtype: object

In [19]:
# Replace "female" and "male" with "Woman" and "Man"
dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head()

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [20]:
# Replace values, show two rows
dataframe.replace(1, "One").head(2)

                           Name PClass Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29  female      One     One
1   Allison, Miss Helen Loraine    1st   2  female        0     One

In [25]:
# Replace values, show two rows
dataframe.replace(r"1st", "First", regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

## Renaming Columns

In [26]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Rename columns, show two rows
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [27]:
# Rename columns, show two rows
dataframe.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [28]:
## A snippet to change to column names
# Load library
import collections

# Create dictionary
column_names = collections.defaultdict(str)

# Create keys
for name in dataframe.columns:
    column_names[name]
    
# Show dictionary
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

## Finding Min, Max, Sum, Avg and Count

In [29]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Calculate statistics
print('Max:', dataframe['Age'].max())
print('Min:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

Max: 71.0
Min: 0.17
Mean: 30.397989417989418
Sum: 22980.88
Count: 756

## Finding Unique Values

In [30]:
# Load library 
import pandas as pd

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Select unique values
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [31]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [32]:
# Select unique values
dataframe['Sex'].nunique()

2

## Handling Missing Values

In [34]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Select missing values, show two rows
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [ ]:
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [36]:
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## Deleting a Column

In [37]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Delete column
dataframe.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [39]:
# Delete columns
dataframe.drop(['Age', 'Sex'], axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [43]:
# Delete column
dataframe.drop(dataframe.columns[1], axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

## Deleting a Row

In [44]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Delete rows, show first two rows of output
dataframe[dataframe['Sex'] != 'male'].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [45]:
# Delete row, show first two rows of output
dataframe[dataframe.index != 0].head()

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

## Dropping Duplicate Rows

In [46]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

dataframe.drop_duplicates().head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [47]:
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [49]:
dataframe.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

## Grouping Rows by Values

In [51]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Group rows by thw values of the column 'Sex', calculate mean of each group
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [52]:
# Group rows, count rows
dataframe.groupby('Survived').count()

          Name  PClass  Age  Sex  SexCode
Survived
0          863     863  443  863      863
1          450     450  313  450      450

In [53]:
# Group rows, count rows
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [54]:
# Group rows, count rows
dataframe.groupby(['Sex', 'Survived']).count()

                 Name  PClass  Age  SexCode
Sex    Survived
female 0          154     154   71      154
       1          308     308  217      308
male   0          709     709  372      709
       1          142     142   96      142

## Grouping Rows by Time

In [55]:
# Load library 
import pandas as pd
import numpy as np

# Create data range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

print(time_index)

DatetimeIndex(['2017-06-06 00:00:00', '2017-06-06 00:00:30',
               '2017-06-06 00:01:00', '2017-06-06 00:01:30',
               '2017-06-06 00:02:00', '2017-06-06 00:02:30',
               '2017-06-06 00:03:00', '2017-06-06 00:03:30',
               '2017-06-06 00:04:00', '2017-06-06 00:04:30',
               ...
               '2017-07-10 17:15:00', '2017-07-10 17:15:30',
               '2017-07-10 17:16:00', '2017-07-10 17:16:30',
               '2017-07-10 17:17:00', '2017-07-10 17:17:30',
               '2017-07-10 17:18:00', '2017-07-10 17:18:30',
               '2017-07-10 17:19:00', '2017-07-10 17:19:30'],
              dtype='datetime64[ns]', length=100000, freq='30S')

In [56]:
# Create DataFrame
dataframe = pd.DataFrame(index=time_index)

# Create column of random values
dataframe['Sale Amount'] = np.random.randint(1,10,100000)

In [59]:
# Group rows by week, calculate sum per week
dataframe.resample('W').sum()

            Sale Amount
2017-06-11        86195
2017-06-18       100519
2017-06-25       101252
2017-07-02       100857
2017-07-09       101273
2017-07-16        10414

In [65]:
# Group rows by two weeks, calculate mean per week
dataframe.resample('2W').mean()

            Sale Amount
2017-06-11     4.988137
2017-06-25     5.004241
2017-07-09     5.013145
2017-07-23     5.006731

In [66]:
# Group rows by month, calculate mean per week
dataframe.resample('M').mean()

            Sale Amount
2017-06-30     5.004236
2017-07-31     5.007321

## Looping Over a Column

In [67]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Print first two names uppercase
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [68]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

## Applying a Function Over All Elements in a Column

In [69]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Create function
def uppercase(x):
    return x.upper()

# Apply function, show two rows
dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

## Applying a Function to Groups

In [72]:
# Load library 
import pandas as pd
import numpy as np

# Create URL
url = 'https://tinyurl.com/titanic-csv'

# Load data as a dataframe
dataframe = pd.read_csv(url)

# Group rows, apply function to groups
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

## Concatenating DataFrames

In [74]:
# Load library 
import pandas as pd
import numpy as np

# Create DataFrame
data_a = {'id': ['1', '2', '3'],
          'first' : ['Alex', 'Emmy', 'Allen'],
          'last' : ['Anderson', 'Ackerman', 'Ali']
         }
dataframe_a = pd.DataFrame(data_a, columns=['id','first','last'])

In [75]:
data_b = {'id': ['4', '5', '6'],
          'first' : ['Blex', 'Bmmy', 'Bllen'],
          'last' : ['Bnderson', 'Bckerman', 'Bli']
         }
dataframe_b = pd.DataFrame(data_b, columns=['id','first','last'])

In [76]:
# Concatenate DataFrames by rows
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2   Emmy  Ackerman
2  3  Allen       Ali
0  4   Blex  Bnderson
1  5   Bmmy  Bckerman
2  6  Bllen       Bli

In [77]:
# Concatenate DataFrames by columns
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first      last
0  1   Alex  Anderson  4   Blex  Bnderson
1  2   Emmy  Ackerman  5   Bmmy  Bckerman
2  3  Allen       Ali  6  Bllen       Bli

In [78]:
# Alternatively
row = pd.Series([10, 'Chris', 'Chillion'], index=['id', 'first', 'last'])

# Append row
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2   Emmy  Ackerman
2   3  Allen       Ali
3  10  Chris  Chillion

## Merging DataFrames

In [81]:
# Load library
import pandas as pd

# Create DataFrame
employee_data = { 'employee_id': ['1', '2', '3', '4'],
                 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']
                }

dataframe_employees = pd.DataFrame(employee_data, columns=['employee_id','name'])

# Create DataFrame
sales_data = { 'employee_id': ['3', '4', '5', '6'],
                 'total_sales': [23456, 2512, 2345, 1455]
                }

dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id','total_sales'])

# Merge DataFrames , default does inner join
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [82]:
# Merge DataFrames , outer join
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [83]:
# Merge DataFrames , left join
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [84]:
# Merge DataFrames , right join
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455